Revit 2027 API
ScheduleField.FieldId Property
 The ID of the field in the containing ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleFieldId FieldId { get; }
Public ReadOnly Property FieldId As ScheduleFieldId
	Get
public:
property ScheduleFieldId^ FieldId {
	ScheduleFieldId^ get ();
}
member FieldId : ScheduleFieldId with get
Property Value
ScheduleFieldId
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace